Revit 2027 API
MEPAnalyticalNode.IsFlowBlocked Property
 Is the flow blocked at this analytical node?
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFlowBlocked { get; }
Public ReadOnly Property IsFlowBlocked As Boolean
	Get
public:
property bool IsFlowBlocked {
	bool get ();
}
member IsFlowBlocked : bool with get
Property Value
Boolean
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace